tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void sendRecordSnapshotJson(const char* source) {
  const DoorRecordSnapshot snapshot = g_records.snapshot();
  Esp32BaseWeb::beginJson(200);
  Esp32BaseWeb::sendChunk("{\"source\":\"");
  Esp32BaseWeb::sendChunk(source);
  Esp32BaseWeb::sendChunk("\",\"count\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"records\":[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]}");
  Esp32BaseWeb::endJson();
}

void sendCommandResultJson(DoorCommandResult result) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::beginJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"positionPulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"targetPulses\":");
  sendInt64(snapshot.targetPulses);
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  Esp32BaseWeb::endJson();
#endif
}

void sendTravelResultJson(DoorCommandResult result, bool configSaved) {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::beginJson(httpCodeFor(result));
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(commandResultName(result));
  Esp32BaseWeb::sendChunk("\",\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"openTurnsX100\":");
  sendInt64(turnsX100FromOpenTargetPulses(snapshot.openTargetPulses));
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"configSaved\":");
  Esp32BaseWeb::sendChunk(configSaved ? "true" : "false");
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  Esp32BaseWeb::endJson();
#endif
}

DoorCommandResult applyTravelUpdate(int64_t openTargetPulses,
                                    int64_t maxRunPulses,
                                    bool& configSaved) {
  configSaved = false;
  if (openTargetPulses <= g_doorConfig.closedPositionPulses || maxRunPulses <= 0) {
    return DoorCommandResult::InvalidArgument;
  }

  const DoorControllerConfig oldDoorConfig = g_doorConfig;
  const int64_t oldProtectionMaxRunPulses = g_motorProtection.maxRunPulses;
  g_doorConfig.openTargetPulses = openTargetPulses;
  g_doorConfig.maxRunPulses = maxRunPulses;
  g_motorProtection.maxRunPulses = maxRunPulses;

  const DoorCommandResult result = g_door.updateTravel(openTargetPulses, maxRunPulses);
  if (result != DoorCommandResult::Ok) {
    g_doorConfig = oldDoorConfig;
    g_motorProtection.maxRunPulses = oldProtectionMaxRunPulses;
    return result;
  }

#if ESP32BASE_ENABLE_APP_CONFIG
  const int64_t turnsX100 = turnsX100FromOpenTargetPulses(openTargetPulses);
  if (turnsX100 > 0 && turnsX100 <= 2000) {
    configSaved = Esp32BaseConfig::setInt("door", "openTurns", static_cast<int32_t>(turnsX100));
  }
#endif
  return result;
}

#if ESP32BASE_ENABLE_APP_CONFIG
void onAppConfigChange(const Esp32BaseAppConfig::Change& change) {
  if (change.field.ns && change.field.key && strcmp(change.field.ns, "door") == 0 &&
      strcmp(change.field.key, "currentGuard") == 0) {
    applyRuntimeConfigFromBase();
    ESP32BASE_LOG_I("farmdoor", "current_guard_runtime_enabled=%s",
                    g_currentGuard.enabled ? "yes" : "no");
  }
}
#endif

void applyRecoveredDoorConfig(const DoorRecoveryState& state) {
  g_doorConfig.closedPositionPulses = state.closedPositionPulses;
  g_doorConfig.openTargetPulses = state.openTargetPulses;
  g_doorConfig.maxRunPulses = state.maxRunPulses;
  g_doorConfig.maxRunMs = state.maxRunMs;
  g_motorProtection.maxRunPulses = state.maxRunPulses;
  g_motorProtection.maxRunMs = state.maxRunMs;
}

void initializeDoorAt24cStore() {
  const Esp32At24cRecordStore::Result beginResult =
      g_at24cStore.begin(g_at24cDevice, kDoorAt24cConfig, kDoorAt24cRegions, kDoorAt24cRegionCount);
  if (beginResult != Esp32At24cRecordStore::Result::Ok) {
    ESP32BASE_LOG_W("farmdoor", "at24c_store_begin_failed result=%u",
                    static_cast<unsigned>(beginResult));
    return;
  }
  g_at24cStoreReady = true;

  DoorRecoveryState recovered;
  const Esp32At24cRecordStore::Result loadResult = loadDoorRecoveryState(g_at24cStore, recovered);
  if (loadResult == Esp32At24cRecordStore::Result::Ok) {
    const DoorCommandResult applyResult = applyDoorRecoveryState(g_door, recovered);
    if (applyResult == DoorCommandResult::Ok) {
      applyRecoveredDoorConfig(recovered);
      ESP32BASE_LOG_I("farmdoor", "door_recovery_restored position=%lld target=%lld",
                      static_cast<long long>(recovered.positionPulses),
                      static_cast<long long>(recovered.openTargetPulses));
    } else {
      ESP32BASE_LOG_W("farmdoor", "door_recovery_apply_failed result=%u",
                      static_cast<unsigned>(applyResult));
    }
    return;
  }
  if (loadResult != Esp32At24cRecordStore::Result::FormatRequired) {
    ESP32BASE_LOG_W("farmdoor", "door_recovery_load_failed result=%u",
                    static_cast<unsigned>(loadResult));
  }
}

bool persistDoorRecoveryStateIfReady() {
  if (!g_at24cStoreReady) {
    return false;
  }
  const DoorRecordTime time = currentRecordTime();
  const DoorRecoveryState state = doorRecoveryStateFromSnapshot(
      g_door.snapshot(), g_doorConfig, time.unixTime, time.uptimeSec, time.bootId);
  const Esp32At24cRecordStore::Result result = saveDoorRecoveryState(g_at24cStore, state);
  if (result == Esp32At24cRecordStore::Result::Ok ||
      result == Esp32At24cRecordStore::Result::Unchanged) {
    return true;
  }
  ESP32BASE_LOG_W("farmdoor", "door_recovery_save_failed result=%u",
                  static_cast<unsigned>(result));
  return false;
}

}  // namespace

FarmDoorApp FarmDoor;

void FarmDoorApp::begin() {
  Serial.begin(115200);
  configureStaticDefaults();
  configureHardwareInputs();

  Esp32Base::setFirmwareInfo("Esp32FarmDoor", "0.1.0");
  configureAppConfigPage();
  configureBusinessShell();

  if (!Esp32Base::begin()) {
    ESP32BASE_LOG_E("farmdoor", "Esp32Base begin failed: %s", Esp32Base::lastError());
  } else {
    initializeDoorAt24cStore();
    applyRuntimeConfigFromBase();
    ESP32BASE_LOG_I("farmdoor", "skeleton ready, ina240a2_gpio=%u enabled=%s",
                    FarmDoorHw.pins().currentAdc,
                    g_currentGuard.enabled ? "yes" : "no");
  }
}

void FarmDoorApp::handle() {
  Esp32Base::handle();
}

